app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "content", "archived", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Random Note"], ["content", "Testing creation of note"], ["archived", false], ["user_id", 1], ["created_at", "2023-08-23 02:45:51.321885"], ["updated_at", "2023-08-23 02:45:51.321885"]]
---
  def create
    @note = Note.new(note_params)
    if @note.save

UPDATE "notes" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "this note has been changed"], ["content", "new content"], ["updated_at", "2023-08-23 04:21:37.758230"], ["id", 36]]
---
  def update
    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 9]]
SELECT "notes".* FROM "notes"
---
  def destroy
    @note.destroy
    notes = Note.all